{
	"name": "A couple of fishermen",
	"symbol": "♙",
	"enter": "You encounter two fishermen who are busy trying to catch fish.",
	"status": {
		"fishingrod": true,
		"noticedFishingRod": false
	},
	"interaction": {
		"barter": {
			"prerequisite": {
				"status_name": "noticedFishingRod",
				"true": {
					"prerequisite": {
						"status_name": "fishingrod",
						"true": {
							"prerequisite": {
								"item": "gold",
								"amount": 10,
								"true": {
									"rate": 0.8,
									"success": {
										"dialogue": [
											"The fishermen agree to trade you their fishingrod for 10 gold.",
											"You are able to convice the men the sell you their spare fishing rod for 10 gold"
										],
										"status_update": {
											"status_name": "fishingrod",
											"status_set": false
										},
										"inventory_update": [
											{
												"name": "fishingrod",
												"amount": 1
											},
											{
												"name": "gold",
												"amount": -10
											}
										]
									},
									"failure": {
										"dialogue": [
											"The fishermen angerly shoo you away, claiming that your bartering scare their catch.",
											"These men would rather not sell you their extra fishingrod. You look suspicious to them"
										]
									}
								},
								"false": {
									"success": {
										"dialogue": [
											"You do not have enough money to trade the fishingrod."
										]
									}
								}
							}
						},
						"false": {
							"success": {
								"dialogue": [
									"The fishermen claim that the've already traded you their only spare fishing rod.",
									"There's only two rods left, that the men currently are fishing with. It's not likely that you will be able to barter them."
								]
							}
						}
					}
				},
				"false": {
					"success": {
						"dialogue": [
							"The fishermen claim that they got nothing to offer you.",
							"These men carry no item of value."
						]
					}
				}
			}
		},
		"perception": {
			"prerequisite": {
				"status_name": "fishingrod",
				"true": {
					"rate": 0.5,
					"success": {
						"dialogue": [
							"You notice that there's an extra fishing rod beside the two men.",
							"Among their fishing equipment, there's an old fishing rod that looks to have not been used for years."
						],
						"status_update": {
							"status_name": "noticedFishingRod",
							"status_set": true
						}
					},
					"failure": {
						"dialogue": [
							"You notice nothing out of the ordinary.",
							"There is nothing here that is worth investigating."
						]
					}
				},
				"false": {
					"success": {
						"dialogue": [
							"Nothing is left here, considering you've already collected their fishing equipment.",
							"There is nothing left here, that you've not already obtained."
						]
					}
				}
			}
		},
		"threaten": {
			"prerequisite": {
				"status_name": "fishingrod",
				"true": {
					"rate": 0.7,
					"success": {
						"dialogue": [
							"The men surrender to your authority, giving you a fishingrod. The only thing of value they have",
							"Your threats scare the fishermen. They back up and offer a nice quality fishingrod as a treaty for free."
						],
						"status_update": {
							"status_name": "fishingrod",
							"status_set": false
						},
						"inventory_update": [
							{
								"name": "fishingrod",
								"amount": 1
							}
						]
					},
					"failure": {
						"dialogue": [
							"While you try your best to exercise your authority over them, the fishermen are unfaced at your attempts.",
							"You try to make clear the consequences of not complying, but the men only mock you as they are scoffing at your threats and continue their business."
						]
					}
				},
				"false": {
					"success": {
						"dialogue": [
							"They scurry away from their position, but they leave nothing left to offer.",
							"You enjoy terrifying these plebians. But there's no bounty left to collect here."
						]
					}
				}
			}
		}
	}
}